# Spark ETL with MySQL and PostgreSQL database

[1. Create Connection with MYSQL Database](#1)

[2. Read Data from MySQL Database](#2)

[3. Transform Data](#3)

[4. Write Data into MYSQL Server](#4)


### Load libraries

In [1]:
# loading libraries and staring spark Sessions
from pyspark.sql import SparkSession

In [2]:
# starting spark session

spark = SparkSession.builder.appName("Spark MySQL1")\
        .getOrCreate()

sqlContext = SparkSession(spark)

#dont show any warning, only errors
spark.sparkContext.setLogLevel("ERROR")

<a id = 1> </a>

## Create Connection with MYSQL Database

In [3]:
# loading CSV files into DataFrame

mysql_df = spark.read \
        .format("jdbc")\
        .option("driver","com.mysql.cj.jdbc.Driver")\
        .option("url","jdbc:mysql://localhost:3306/dataeng")\
        .option("dbtable","user")\
        .option("user","root")\
        .option("password","H.modi1997")\
        .load()

In [4]:
mysql_df.printSchema()

root
 |-- id: integer (nullable = true)
 |-- name: string (nullable = true)

<a id = 2>  </a> 
## Read Data from MySQL Database

In [5]:
mysql_df.show(n=5)

+---+-------------+
| id|         name|
+---+-------------+
|  1| Dustin Smith|
|  2|  Jay Ramirez|
|  3| Joseph Cooke|
|  4|Melinda Young|
|  5|  Sean Parker|
+---+-------------+
only showing top 5 rows

<a id = 3>  </a>

## Transform Data

In [8]:
mysql_df.createOrReplaceTempView("tempMySQL")

In [9]:
sqlContext.sql("select * from tempMySQL limit 10").show()

+---+-------------------+
| id|               name|
+---+-------------------+
|  1|       Dustin Smith|
|  2|        Jay Ramirez|
|  3|       Joseph Cooke|
|  4|      Melinda Young|
|  5|        Sean Parker|
|  6|         Ian Foster|
|  7|Christopher Schmitt|
|  8|  Patrick Gutierrez|
|  9|     Dennis Douglas|
| 10|      Brenda Morris|
+---+-------------------+

In [10]:
new_df = sqlContext.sql("select name as First_Name from tempMySQL where id > 40 ")

<a id = 4> </a>

## Write Data into MYSQL Server

In [11]:

new_df.write \
    .format("jdbc")\
    .option("driver","com.mysql.cj.jdbc.Driver")\
    .option("url","jdbc:mysql://localhost:3306/dataeng")\
    .option("dbtable","userdata_100")\
    .option("user","root")\
    .option("password","H.modi1997")\
    .save()

In [12]:
spark.stop()